---
kind: type
id: T:Autodesk.Revit.DB.CombinableElementArrayIterator
source: html/20ec8352-e767-2eff-609f-c71f19806631.htm
---
# Autodesk.Revit.DB.CombinableElementArrayIterator

An iterator to an CombinableElement array.

## Syntax (C#)
```csharp
public abstract class CombinableElementArrayIterator : APIObject,
	IEnumerator
```